ChibiOS/ChibiOS/os/hal/platforms/STM32F37x/hal_lld.h
#define STM32_USBPRE_DIV1P5     (0U << 22)  /**< USB clock is PLLCLK/1.5.   */
#define STM32_USBPRE_DIV1       (1U << 22)  /**< USB clock is PLLCLK/1.     */

#define STM32_MCOSEL_NOCLOCK    (0U << 24)  /**< No clock on MCO pin.       */
#define STM32_MCOSEL_LSI        (2U << 24)  /**< LSI clock on MCO pin.      */
#define STM32_MCOSEL_LSE        (3U << 24)  /**< LSE clock on MCO pin.      */
#define STM32_MCOSEL_SYSCLK     (4U << 24)  /**< SYSCLK on MCO pin.         */
#define STM32_MCOSEL_HSI        (5U << 24)  /**< HSI clock on MCO pin.      */
#define STM32_MCOSEL_HSE        (6U << 24)  /**< HSE clock on MCO pin.      */
#define STM32_MCOSEL_PLLDIV2    (7U << 24)  /**< PLL/2 clock on MCO pin.    */

#define STM32_SDPRE_DIV2        (16U << 27) /**< SYSCLK divided by 2.       */
#define STM32_SDPRE_DIV4        (17U << 27) /**< SYSCLK divided by 4.       */
#define STM32_SDPRE_DIV6        (18U << 27) /**< SYSCLK divided by 6.       */
#define STM32_SDPRE_DIV8        (19U << 27) /**< SYSCLK divided by 8.       */
#define STM32_SDPRE_DIV10       (20U << 27) /**< SYSCLK divided by 10.      */
#define STM32_SDPRE_DIV12       (21U << 27) /**< SYSCLK divided by 12.      */
#define STM32_SDPRE_DIV14       (22U << 27) /**< SYSCLK divided by 14.      */
#define STM32_SDPRE_DIV16       (23U << 27) /**< SYSCLK divided by 16.      */
#define STM32_SDPRE_DIV20       (24U << 27) /**< SYSCLK divided by 20.      */
#define STM32_SDPRE_DIV24       (25U << 27) /**< SYSCLK divided by 24.      */
#define STM32_SDPRE_DIV28       (26U << 27) /**< SYSCLK divided by 28.      */
#define STM32_SDPRE_DIV32       (27U << 27) /**< SYSCLK divided by 32.      */
#define STM32_SDPRE_DIV36       (28U << 27) /**< SYSCLK divided by 36.      */
#define STM32_SDPRE_DIV40       (29U << 27) /**< SYSCLK divided by 40.      */
#define STM32_SDPRE_DIV44       (30U << 27) /**< SYSCLK divided by 44.      */
#define STM32_SDPRE_DIV48       (31U << 27) /**< SYSCLK divided by 48.      */
/** @} */

/**
 * @name    RCC_BDCR register bits definitions
 * @{
 */
#define STM32_RTCSEL_MASK       (3U << 8)   /**< RTC clock source mask.     */
#define STM32_RTCSEL_NOCLOCK    (0U << 8)   /**< No clock.                  */
#define STM32_RTCSEL_LSE        (1U << 8)   /**< LSE used as RTC clock.     */
#define STM32_RTCSEL_LSI        (2U << 8)   /**< LSI used as RTC clock.     */
#define STM32_RTCSEL_HSEDIV     (3U << 8)   /**< HSE divided by 32 used as
                                                 RTC clock.                 */
/** @} */

/**
 * @name    RCC_CFGR2 register bits definitions
 * @{
 */
#define STM32_PREDIV_MASK       (15U << 0)  /**< PREDIV divisor mask.       */
/** @} */

/**
 * @name    RCC_CFGR3 register bits definitions
 * @{
 */
#define STM32_USART1SW_MASK     (3U << 0)   /**< USART1 clock source mask. */
#define STM32_USART1SW_PCLK     (0U << 0)   /**< USART1 clock is PCLK.     */
#define STM32_USART1SW_SYSCLK   (1U << 0)   /**< USART1 clock is SYSCLK.   */
#define STM32_USART1SW_LSE      (2U << 0)   /**< USART1 clock is LSE.      */
#define STM32_USART1SW_HSI      (3U << 0)   /**< USART1 clock is HSI.      */
#define STM32_I2C1SW_MASK       (1U << 4)   /**< I2C1 clock source mask.   */
#define STM32_I2C1SW_HSI        (0U << 4)   /**< I2C1 clock is HSI.        */
#define STM32_I2C1SW_SYSCLK     (1U << 4)   /**< I2C1 clock is SYSCLK.     */
#define STM32_I2C2SW_MASK       (1U << 5)   /**< I2C2 clock source mask.   */
#define STM32_I2C2SW_HSI        (0U << 5)   /**< I2C2 clock is HSI.        */
#define STM32_I2C2SW_SYSCLK     (1U << 5)   /**< I2C2 clock is SYSCLK.     */
#define STM32_USART2SW_MASK     (3U << 16)  /**< USART2 clock source mask. */
#define STM32_USART2SW_PCLK     (0U << 16)  /**< USART2 clock is PCLK.     */
#define STM32_USART2SW_SYSCLK   (1U << 16)  /**< USART2 clock is SYSCLK.   */
#define STM32_USART2SW_LSE      (2U << 16)  /**< USART2 clock is LSE.      */
#define STM32_USART2SW_HSI      (3U << 16)  /**< USART2 clock is HSI.      */
#define STM32_USART3SW_MASK     (3U << 18)  /**< USART3 clock source mask. */
#define STM32_USART3SW_PCLK     (0U << 18)  /**< USART3 clock is PCLK.     */
#define STM32_USART3SW_SYSCLK   (1U << 18)  /**< USART3 clock is SYSCLK.   */
#define STM32_USART3SW_LSE      (2U << 18)  /**< USART3 clock is LSE.      */
#define STM32_USART3SW_HSI      (3U << 18)  /**< USART3 clock is HSI.      */
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Disables the PWR/RCC initialization in the HAL.
 */
#if !defined(STM32_NO_INIT) || defined(__DOXYGEN__)
#define STM32_NO_INIT                       FALSE
#endif

/**
 * @brief   Enables or disables the programmable voltage detector.
 */
#if !defined(STM32_PVD_ENABLE) || defined(__DOXYGEN__)
#define STM32_PVD_ENABLE                    FALSE
#endif

/**
 * @brief   Sets voltage level for programmable voltage detector.
 */
#if !defined(STM32_PLS) || defined(__DOXYGEN__)
#define STM32_PLS                           STM32_PLS_LEV0
#endif

/**
 * @brief   Enables or disables the HSI clock source.
 */
#if !defined(STM32_HSI_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSI_ENABLED                   TRUE
#endif

/**
 * @brief   Enables or disables the LSI clock source.
 */
#if !defined(STM32_LSI_ENABLED) || defined(__DOXYGEN__)
#define STM32_LSI_ENABLED                   TRUE
#endif

/**
 * @brief   Enables or disables the HSE clock source.
 */
#if !defined(STM32_HSE_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSE_ENABLED                   TRUE
#endif

/**
 * @brief   Enables or disables the LSE clock source.
 */
#if !defined(STM32_LSE_ENABLED) || defined(__DOXYGEN__)
#define STM32_LSE_ENABLED                   FALSE
#endif

/**
 * @brief   Main clock source selection.
 * @note    If the selected clock source is not the PLL then the PLL is not
 *          initialized and started.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using the PLL.
 */
#if !defined(STM32_SW) || defined(__DOXYGEN__)
#define STM32_SW                            STM32_SW_PLL
#endif

/**
 * @brief   Clock source for the PLL.
 * @note    This setting has only effect if the PLL is selected as the
 *          system clock source.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using the PLL.
 */
#if !defined(STM32_PLLSRC) || defined(__DOXYGEN__)
#define STM32_PLLSRC                        STM32_PLLSRC_HSE
#endif

/**
 * @brief   Crystal PLL pre-divider.
 * @note    This setting has only effect if the PLL is selected as the
 *          system clock source.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using the PLL.
 */
#if !defined(STM32_PREDIV_VALUE) || defined(__DOXYGEN__)
#define STM32_PREDIV_VALUE                  1
#endif

/**
 * @brief   PLL multiplier value.
 * @note    The allowed range is 2...16.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using the PLL.
 */
#if !defined(STM32_PLLMUL_VALUE) || defined(__DOXYGEN__)
#define STM32_PLLMUL_VALUE                  9
#endif

/**
 * @brief   AHB prescaler value.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using the PLL.
 */
#if !defined(STM32_HPRE) || defined(__DOXYGEN__)
#define STM32_HPRE                          STM32_HPRE_DIV1
#endif

/**
 * @brief   APB1 prescaler value.
 */
#if !defined(STM32_PPRE1) || defined(__DOXYGEN__)
#define STM32_PPRE1                         STM32_PPRE1_DIV2
#endif

/**
 * @brief   APB2 prescaler value.
 */
#if !defined(STM32_PPRE2) || defined(__DOXYGEN__)
#define STM32_PPRE2                         STM32_PPRE2_DIV2
#endif

/**
 * @brief   MCO pin setting.
 */
#if !defined(STM32_MCOSEL) || defined(__DOXYGEN__)
#define STM32_MCOSEL                        STM32_MCOSEL_NOCLOCK
#endif

/**
 * @brief   ADC prescaler value.
 */
#if !defined(STM32_ADCPRE) || defined(__DOXYGEN__)
#define STM32_ADCPRE                        STM32_ADCPRE_DIV4
#endif

/**
 * @brief   SDADC prescaler value.
 */
#if !defined(STM32_SDPRE) || defined(__DOXYGEN__)
#define STM32_SDPRE                         STM32_SDPRE_DIV12
#endif

/**
 * @brief   USART1 clock source.
 */
#if !defined(STM32_USART1SW) || defined(__DOXYGEN__)
#define STM32_USART1SW                      STM32_USART1SW_PCLK
#endif

/**
 * @brief   USART2 clock source.
 */
#if !defined(STM32_USART2SW) || defined(__DOXYGEN__)
#define STM32_USART2SW                      STM32_USART2SW_PCLK
#endif

/**
 * @brief   USART3 clock source.
 */
#if !defined(STM32_USART3SW) || defined(__DOXYGEN__)
#define STM32_USART3SW                      STM32_USART3SW_PCLK
#endif

/**
 * @brief   I2C1 clock source.
 */
#if !defined(STM32_I2C1SW) || defined(__DOXYGEN__)
#define STM32_I2C1SW                        STM32_I2C1SW_SYSCLK
#endif

/**
 * @brief   I2C2 clock source.
 */
#if !defined(STM32_I2C2SW) || defined(__DOXYGEN__)
#define STM32_I2C2SW                        STM32_I2C2SW_SYSCLK
#endif

/**
 * @brief   RTC clock source.
 */
#if !defined(STM32_RTCSEL) || defined(__DOXYGEN__)
#define STM32_RTCSEL                        STM32_RTCSEL_LSI
#endif

/**
 * @brief   USB clock setting.
 */
#if !defined(STM32_USB_CLOCK_REQUIRED) || defined(__DOXYGEN__)
#define STM32_USB_CLOCK_REQUIRED            TRUE
#endif

/**
 * @brief   USB prescaler initialization.
 */
#if !defined(STM32_USBPRE) || defined(__DOXYGEN__)
#define STM32_USBPRE                        STM32_USBPRE_DIV1P5
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

